# Rebar Crank Overridable Parameters Get Crank Start Ratio Formula Params Method

Source: https://www.revitapidocs.com/2026/227066e5-4681-8b0e-58ad-f307559221cc.htm

---

| Rebar Crank Overridable Parameters Get Crank Start Ratio Formula Params Method |
| --- |

Gets the formula parameter ids defined in the RebarShape family which are associated with start crank ratio parameters.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ISet<ElementId> GetCrankStartRatioFormulaParams()
```

```
Public Function GetCrankStartRatioFormulaParams As ISet(Of ElementId)
```

```
public:
ISet<ElementId^>^ GetCrankStartRatioFormulaParams()
```

```
member GetCrankStartRatioFormulaParams : unit -> ISet<ElementId>
```

#### Return Value

ISet ElementId
Returns the formula parameter ids defined in the RebarShape family which are associated with start crank ratio parameters. See Also

#### Reference

RebarCrankOverridableParameters Class Autodesk.Revit.DB.Structure Namespace